l10n.so = { lang: 'ru'
    ,modname: "СУПРОбувь"
    ,tooltip: "запуск СУПРОбувь"
    ,title: 'Система Управления Продажами Размеров Обуви'
    ,err_title: 'Ошибка работы Системы Управления Продажами Размеров Обуви'
    ,docs: "Документация/Помощь"
    ,dhnew: "Новое"
    ,dhupdate: "Обновленно"
    ,dhexperiment: "Экспериментальное"
    ,seasons: 'Сезоны/Коллекции'
    ,objects: 'Торговые объекты'
    ,other: 'Прочее'
    ,orders: "Заказы/Сезоны"
    ,action: 'Действие<br>(+добавление,=изменение)'
    ,comment: 'Описание'
    ,in_stock: "Приходы/Поставки"
    ,in_stock_title: " Приход"
    ,in_stock_new: "Приход поставки/сезона: "
    ,in_stock_models:
    "Создать приход моделей в количестве: <b>{0}</b> шт.?<br><br>"+
    "Описание приходного документа или коментарий:"
    ,in_stock_doc: "Приход от "
    ,no: '№'
    ,id: 'ID'
    ,remain: "Остатки"
    ,sel: "Продажи"
    ,lists: "Списки/Реестры"
    ,reports: "Отчёты"

    ,hot_season: 'Весна-лето '
    ,cold_season: 'Осень-зима '

    ,create_season: "Создать Сезон/Коллекцию"
    ,edit_season: "Изменить метаданные"
    ,open_season_ord: "Открыть Заказ (модели)"
    ,open_season_ins: "Открыть Приходы (CMR/накладные)"
    ,open_season_insd: "Открыть Документ (приход/накладная)"
    ,view_history: "История"
    ,export_xls: "Экспорт (Excel)"
    ,press: 'Нажмите '
    ,ord_import:
    '<b style="color:red">ВНИМАНИЕ:</b><br>'+
    '1. Первая строка -- заголовки<br>'+
    '2. Вторая идентификаторы (pcode, id_mfg...)<br>'+
    '3...n Данные (пример):'
    ,copy: 'После этого в буфер обмена скопируются данные таблицы.'
    ,refresh: 'Обновить данные'
    ,add_items: "Вставить строки заказа"
    ,add_to_ins: "В приход"
    ,add_sizes: "Вставить размеры"
    ,add_skus: "Вставить артикулы"
    ,order_sizes: "Размеры заказа"

    ,ins_distr: 'Распределить всё'
    ,ins_distrz: 'Распределить ноль'

    ,undo: 'Отменить'
    ,commit: 'Подтвердить'
    ,save: 'Сохранить'
    ,addrow: '<b>+</b> Строка'
    ,delrow: '<b>-</b> Строка'
    ,filter: 'Фильтр'
    ,filterTxtSKU: 'Найти текст с начала. <b>Пробел</b> + текст: найти в любом месте.'
    ,filterTxt: 'Найти текст с начала или набор значений.'
    ,filterSet: 'Оставить только выбранные значения.'

    ,fsetAddNewSeason: '№ поставки / Год / Сезон'
    ,fsetAddNewSeasonInput: 'Ввод данных о новом сезоне/коллекции/поставке'
    ,fsetRetailPricePlan: 'Предварительный рассчёт Розничной Цены'
    ,setupGrid: 'Конфигурация данных в таблице'

    ,rateDollar: 'Курс $'
    ,rateEuro: 'Курс €'
    ,curr: 'бел.&nbsp;руб.'
    ,interestFemale: 'Наценка жен.'
    ,interestMale: 'Наценка муж.'

    ,import_data_title: 'Импорт данных'
    ,total_paste: 'Всего вставленно строк: '
    ,dup_size_id: 'Повторение размера "<b>{0}</b>" в сетке! Строка {1}, где-то под артикулом <b>{2}</b>'
    ,dup_column_id: 'Повторение колонки: '
    ,dup_sku: 'Повторение Артикула: "<b>{0}</b>". Строка: {1}.<br>Берётся первое значение.'
    ,no_data: 'Нет данных для импорта'
    ,no_data_ins: 'Нет выделенных строк (моделей) для прихода!'

    ,total_ord: 'Всего заказ'
    ,total_ins: 'Всего приход'

    ,clmn:{
        foto: 'Фото'
       ,add: 'Когда создано'
       ,pname: 'Название'
       ,pcode: 'Артикул'
       ,gend: 'Пол'

       ,ftext: 'Название колонки'
       ,ftype: 'Тип данных'
       ,fname: 'Имя поля'
       ,code: 'Код поля: '
       ,comment: 'Описание/Комментарий прихода'

       ,dates_add_edit: 'Дата, время создания/изменения'
       ,ce_by: 'Кем'
       ,ce_byr: 'Роль'
       ,totals: 'Количество заказ/приход'

       ,id: 'ID'
       ,add_by: 'Кем создано'
       ,edit: 'Изменено'
       ,edit_by: 'Кем изменено'
       ,in_stock: '№ Поставки'
       ,total_plan: 'Всего план'
       ,total_done: 'Всего выполнено'
       ,total_ord: 'Кол-во<br>заказа'
       ,total_rmn: 'Остатки<br>вцелом'
       ,total_sld: 'Кол-во<br>продано'
       ,total_qty: "Кол-во<br>на объекте"
       ,total_ins: 'Кол-во<br>заказ<br>приход'
       ,total_insd: 'Кол-во<br>приход'
       ,total_itms: 'Кол-во<br>моделей'

       ,ps_ret: 'Цена розничная'
       ,ps_ord: 'Цена заказа'

       ,g_matpk: 'Подкладка'
       ,g_matst: 'Стелька'
       ,g_matpd: 'Подошва'
       ,g_heel: 'Каблук'
       ,g_cntr: 'Страна'

       ,pairs: 'пар'
       ,id_mpcode: 'Внутренний код'
       ,id_mfg: 'TM'
       ,id_in: '№'
       ,pcode: "Артикул производителя"
       ,gend: "Пол"
       ,prodname: "Название/Верх"
       ,g_color: "Цвет"
       ,g_material: "Материал верха"
       ,g_sizes_set: "Набор размеров"
       ,g_sizes: "Размеры"
       ,g_sizes_sum: "Сумма по размерам"
       ,g_sizes_i: 'Размеры:<br>заказ<br>приход'
       ,g_sizes_di: 'Размеры: приход'
       ,sert: 'Сертификат'
       ,sert_from: 'Сертификат С'
       ,sert_to: 'Сертификат По'

       ,more: 'Дополнительная информация'
       ,whvolume: 'Объём на складе'
       ,square: 'Площадь торговая'
    }

// application backend errors

    // ** seasons **
   ,'~seasn_exists': "Сезон уже существует под номером: "
   ,'~id': 'Отсутствует идентификатор `id` модели в строке: '
   ,'~id_mpcode': 'Отсутствует идентификатор `id_mpcode` модели в строке: '
   ,'~find_ids': 'Не найдены все запрошенные модели (возможно заказ был изменён).'
   ,'~find': 'Отсустствуют данные по запросу.'
   ,'~arrins': 'Содержимое документа прихода не является массивом (array).'
   ,'~insupdt': 'Не возможно записать документ прихода. Кто-то его изменяет (см. историю).'
   ,'~i.id!=o.id': 'Невозможно сохранить.<br>Порядок или количество моделей прихода и заказа не совпадает. Возможно был изменён заказ.'
   ,'~i.n!=o.n': 'Невозможно сохранить.<br>Размерная сетка модели в приходе не совпадает с заказом. Возможно был изменён заказ.'
   ,'~i.o!=o.o': 'Размерная сетка модели в приходе не совпадает с заказом.<br>Возможно был изменён заказ.<br><br>Сохраняется только сетка прихода этой модели (обновите данные).'
   ,'~total_ord=0': 'Сумма в заказе равна нулю. Что-то пошло не так.'


    // ** objects **

   ,add_obj: 'Добавить объект'
   ,edit_obj: 'Изменить объект'
   ,show_models: 'Показать модели (остатки)'
   ,show_distr: 'Распределить модели'
   ,shop: 'Магазин ..'
   ,warehouse: 'Склад ..'

   ,fsetObjectType: 'Идентификатор, магазин/склад'
   ,fsetObjectMore: 'Дополнительное описание объекта'
   ,fsetObjectConfig: 'Настройки'
   ,objRemote: 'Объект на удалении, создать: транспорт + права доступа (должности/роли)'
   ,m2: '\u043c\u00b2'
   ,m3: '\u043c\u00b3'
   ,tipObject:{
        name: '<b>name</b>: Введите <b>латиницей</b> уникальное название объекта с указанным префиксом',
        more: 'Введите дополнительное описание объекта (тип желательно не менять)',
        WinObjects:
        'При создании первым делом указать тип,<br>потом заполнить информацию.<br>' +
        'При редактировании менять идентификатор уже нельзя.'
   }
  ,'~latin': 'Поле не заполненно латинскими символами (без пунктуации)!'
  ,'~obj_exists': 'Объект уже существует в базе данных!'
}

// fatal backend errors
// ** seasons **
l10n['!hsts'] = 'Действие не прошло. Не сохранена начальная история изменений Базы Данных. Фатально. Обратитесь к разработчику.'
l10n['!hste'] = 'Не сохранёна конечная история изменений Базы Данных. Фатально. Обратитесь к разработчику.'
l10n['!insdoc'] = 'Ошибка записи документа прихода! Обратитесь к разработчику.'
l10n['!stat'] = 'Не найдено описание коллекции (нулевой документ)! Обратитесь к разработчику.'
l10n['!meta'] = l10n['!stat']
l10n['!cnt'] = 'Действие не прошло. Количество записей в БД равно нулю, что не допустимо. (Что-то сильно сломалось).'

l10n['!insupdt'] = 'Ошибка сохранения прихода. Не все модели были обновленны! Фатально. Обратитесь к разработчику.'

// ** objects **
//l10n[''] = ''
