l10n.sp = { lang: 'ru' //!!! локализация используется только в UI (для простоты обновления)
    ,modname: "Обувная Касса"
    ,tooltip: "Продажа моделей по размерам с системой скидок. Возвраты"
    ,title: 'Касса прототип'
    ,selling: 'ПРОДАЖА'
    ,returns: 'ВОЗВРАТ'
    ,select_action:'Выбор Действия:'
    ,scale: 'Размер'
    ,count: 'Кол-во'
    ,cart_title: 'Товарный чек'
    ,total: 'Итого:'
    ,paid: 'внесено'
    ,change: 'сдача'
    ,sku: 'Поиск артикула'
    ,sku_help:
'<b>3 символа</b> минимум для загрузки<br>' +
'<b>Пробел</b> - загрузить все модели с ненулевыми остатками<br>' +
'<b>Ввод</b> - перейти к выбору размера (на следующий элемент)'
    ,can:{
        'App.view.desktop.BackendTools':'Управление (запуск/остановка) основного проыесса (мозгов, node.js)'
       ,'App.backend.JS':              'Запуск кода в мозгах'
    }
}
